### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sonarcube-aci.azurerm_resource_group.sonarqube_rg[0] has been deleted
-   resource "azurerm_resource_group" "sonarqube_rg" {
-       id       = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo" -> null
-       location = "uksouth" -> null
-       name     = "Terraform-Sonarqube-aci-demo" -> null
        tags     = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
    }

  # module.sonarcube-aci.azurerm_storage_account.sonarqube_sa has been deleted
-   resource "azurerm_storage_account" "sonarqube_sa" {
-       id                                = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo/providers/Microsoft.Storage/storageAccounts/sonarqubesa9000" -> null
-       name                              = "sonarqubesa9000" -> null
-       primary_access_key                = (sensitive value)
        tags                              = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (33 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["conf"] has been deleted
-   resource "azurerm_storage_share" "sonarqube" {
-       access_tier          = "TransactionOptimized" -> null
-       enabled_protocol     = "SMB" -> null
-       id                   = "https://sonarqubesa9000.file.core.windows.net/conf" -> null
-       metadata             = {} -> null
-       name                 = "conf" -> null
-       quota                = 1 -> null
-       resource_manager_id  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo/providers/Microsoft.Storage/storageAccounts/sonarqubesa9000/fileServices/default/fileshares/conf" -> null
-       storage_account_name = "sonarqubesa9000" -> null
-       url                  = "https://sonarqubesa9000.file.core.windows.net/conf" -> null
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["data"] has been deleted
-   resource "azurerm_storage_share" "sonarqube" {
-       access_tier          = "TransactionOptimized" -> null
-       enabled_protocol     = "SMB" -> null
-       id                   = "https://sonarqubesa9000.file.core.windows.net/data" -> null
-       metadata             = {} -> null
-       name                 = "data" -> null
-       quota                = 10 -> null
-       resource_manager_id  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo/providers/Microsoft.Storage/storageAccounts/sonarqubesa9000/fileServices/default/fileshares/data" -> null
-       storage_account_name = "sonarqubesa9000" -> null
-       url                  = "https://sonarqubesa9000.file.core.windows.net/data" -> null
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["extensions"] has been deleted
-   resource "azurerm_storage_share" "sonarqube" {
-       access_tier          = "TransactionOptimized" -> null
-       enabled_protocol     = "SMB" -> null
-       id                   = "https://sonarqubesa9000.file.core.windows.net/extensions" -> null
-       metadata             = {} -> null
-       name                 = "extensions" -> null
-       quota                = 10 -> null
-       resource_manager_id  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo/providers/Microsoft.Storage/storageAccounts/sonarqubesa9000/fileServices/default/fileshares/extensions" -> null
-       storage_account_name = "sonarqubesa9000" -> null
-       url                  = "https://sonarqubesa9000.file.core.windows.net/extensions" -> null
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["logs"] has been deleted
-   resource "azurerm_storage_share" "sonarqube" {
-       access_tier          = "TransactionOptimized" -> null
-       enabled_protocol     = "SMB" -> null
-       id                   = "https://sonarqubesa9000.file.core.windows.net/logs" -> null
-       metadata             = {} -> null
-       name                 = "logs" -> null
-       quota                = 10 -> null
-       resource_manager_id  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-demo/providers/Microsoft.Storage/storageAccounts/sonarqubesa9000/fileServices/default/fileshares/logs" -> null
-       storage_account_name = "sonarqubesa9000" -> null
-       url                  = "https://sonarqubesa9000.file.core.windows.net/logs" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.sonarcube-aci.azurerm_container_group.sonarqube_aci will be created
+   resource "azurerm_container_group" "sonarqube_aci" {
+       dns_name_label      = "sonarqube-aci"
+       exposed_port        = (known after apply)
+       fqdn                = (known after apply)
+       id                  = (known after apply)
+       ip_address          = (known after apply)
+       ip_address_type     = "Public"
+       location            = "uksouth"
+       name                = "sonarqubeaci9000"
+       os_type             = "Linux"
+       resource_group_name = "Terraform-Sonarqube-aci-demo"
+       restart_policy      = "OnFailure"
+       tags                = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }

+       container {
+           commands                     = []
+           cpu                          = 2
+           image                        = "sonarqube:lts-community"
+           memory                       = 8
+           name                         = "sonarqube-server"
+           secure_environment_variables = (sensitive value)

+           ports {
+               port     = 9000
+               protocol = "TCP"
            }

+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/data"
+               name                 = "data"
+               read_only            = false
+               share_name           = "data"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa9000"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/extensions"
+               name                 = "extensions"
+               read_only            = false
+               share_name           = "extensions"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa9000"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/logs"
+               name                 = "logs"
+               read_only            = false
+               share_name           = "logs"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa9000"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/conf"
+               name                 = "conf"
+               read_only            = false
+               share_name           = "conf"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa9000"
            }
        }
+       container {
+           commands = [
+               "caddy",
+               "reverse-proxy",
+               "--from",
+               "sonar.pwd9000.com",
+               "--to",
+               "localhost:9000",
            ]
+           cpu      = 1
+           image    = "caddy:latest"
+           memory   = 1
+           name     = "caddy-reverse-proxy"

+           ports {
+               port     = 443
+               protocol = "TCP"
            }
+           ports {
+               port     = 80
+               protocol = "TCP"
            }
        }
    }

  # module.sonarcube-aci.azurerm_key_vault.sonarqube_kv will be created
+   resource "azurerm_key_vault" "sonarqube_kv" {
+       access_policy              = (known after apply)
+       enable_rbac_authorization  = true
+       id                         = (known after apply)
+       location                   = "uksouth"
+       name                       = "sonarqubekv9000"
+       resource_group_name        = "Terraform-Sonarqube-aci-demo"
+       sku_name                   = "standard"
+       soft_delete_retention_days = 90
+       tags                       = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       tenant_id                  = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                  = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.password_secret will be created
+   resource "azurerm_key_vault_secret" "password_secret" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sonarq-sa-password"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.username_secret will be created
+   resource "azurerm_key_vault_secret" "username_secret" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sonarq-sa-username"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.sonarcube-aci.azurerm_mssql_database.sonarqube_mssql_db will be created
+   resource "azurerm_mssql_database" "sonarqube_mssql_db" {
+       auto_pause_delay_in_minutes         = 60
+       collation                           = "SQL_Latin1_General_CP1_CS_AS"
+       create_mode                         = "Default"
+       creation_source_database_id         = (known after apply)
+       geo_backup_enabled                  = true
+       id                                  = (known after apply)
+       ledger_enabled                      = (known after apply)
+       max_size_gb                         = 128
+       min_capacity                        = 1
+       name                                = "sonarqubemssqldb9000"
+       read_replica_count                  = (known after apply)
+       read_scale                          = false
+       restore_point_in_time               = (known after apply)
+       sample_name                         = (known after apply)
+       server_id                           = (known after apply)
+       sku_name                            = "GP_S_Gen5_2"
+       storage_account_type                = "Zone"
+       tags                                = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       transparent_data_encryption_enabled = true
+       zone_redundant                      = false

+       long_term_retention_policy {
+           monthly_retention = (known after apply)
+           week_of_year      = (known after apply)
+           weekly_retention  = (known after apply)
+           yearly_retention  = (known after apply)
        }

+       short_term_retention_policy {
+           backup_interval_in_hours = 12
+           retention_days           = 7
        }

+       threat_detection_policy {
+           disabled_alerts            = (known after apply)
+           email_account_admins       = (known after apply)
+           email_addresses            = (known after apply)
+           retention_days             = (known after apply)
+           state                      = (known after apply)
+           storage_account_access_key = (sensitive value)
+           storage_endpoint           = (known after apply)
        }
    }

  # module.sonarcube-aci.azurerm_mssql_firewall_rule.sonarqube_mssql_fw_rules[0] will be created
+   resource "azurerm_mssql_firewall_rule" "sonarqube_mssql_fw_rules" {
+       end_ip_address   = "0.0.0.0"
+       id               = (known after apply)
+       name             = "Allow All Azure IPs"
+       server_id        = (known after apply)
+       start_ip_address = "0.0.0.0"
    }

  # module.sonarcube-aci.azurerm_mssql_server.sonarqube_mssql will be created
+   resource "azurerm_mssql_server" "sonarqube_mssql" {
+       administrator_login                  = (sensitive)
+       administrator_login_password         = (sensitive value)
+       connection_policy                    = "Default"
+       fully_qualified_domain_name          = (known after apply)
+       id                                   = (known after apply)
+       location                             = "uksouth"
+       minimum_tls_version                  = "1.2"
+       name                                 = "sonarqubemssql9000"
+       outbound_network_restriction_enabled = false
+       primary_user_assigned_identity_id    = (known after apply)
+       public_network_access_enabled        = true
+       resource_group_name                  = "Terraform-Sonarqube-aci-demo"
+       restorable_dropped_database_ids      = (known after apply)
+       tags                                 = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       version                              = "12.0"
    }

  # module.sonarcube-aci.azurerm_resource_group.sonarqube_rg[0] will be created
+   resource "azurerm_resource_group" "sonarqube_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Terraform-Sonarqube-aci-demo"
+       tags     = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
    }

  # module.sonarcube-aci.azurerm_role_assignment.kv_role_assigment["Key Vault Administrator"] will be created
+   resource "azurerm_role_assignment" "kv_role_assigment" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "0e4c0ac9-2f9d-4b1f-892a-d675d212d783"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_account.sonarqube_sa will be created
+   resource "azurerm_storage_account" "sonarqube_sa" {
+       access_tier                       = "Hot"
+       account_kind                      = "StorageV2"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = true
+       cross_tenant_replication_enabled  = true
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "uksouth"
+       min_tls_version                   = "TLS1_2"
+       name                              = "sonarqubesa9000"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "Terraform-Sonarqube-aci-demo"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"
+       tags                              = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }

+       blob_properties {
+           change_feed_enabled           = (known after apply)
+           change_feed_retention_in_days = (known after apply)
+           default_service_version       = (known after apply)
+           last_access_time_enabled      = (known after apply)
+           versioning_enabled            = (known after apply)

+           container_delete_retention_policy {
+               days = (known after apply)
            }

+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           delete_retention_policy {
+               days = (known after apply)
            }
        }

+       network_rules {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)

+           private_link_access {
+               endpoint_resource_id = (known after apply)
+               endpoint_tenant_id   = (known after apply)
            }
        }

+       queue_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           hour_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }

+           logging {
+               delete                = (known after apply)
+               read                  = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
+               write                 = (known after apply)
            }

+           minute_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }
        }

+       routing {
+           choice                      = (known after apply)
+           publish_internet_endpoints  = (known after apply)
+           publish_microsoft_endpoints = (known after apply)
        }

+       share_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           retention_policy {
+               days = (known after apply)
            }

+           smb {
+               authentication_types            = (known after apply)
+               channel_encryption_type         = (known after apply)
+               kerberos_ticket_encryption_type = (known after apply)
+               versions                        = (known after apply)
            }
        }
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["conf"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "conf"
+       quota                = 1
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa9000"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["data"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "data"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa9000"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["extensions"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "extensions"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa9000"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["logs"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "logs"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa9000"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share_file.sonar_properties will be created
+   resource "azurerm_storage_share_file" "sonar_properties" {
+       content_length   = (known after apply)
+       content_type     = "application/octet-stream"
+       id               = (known after apply)
+       name             = "sonar.properties"
+       source           = "/home/runner/work/terraform-azurerm-sonarqube-aci/terraform-azurerm-sonarqube-aci/sonar.properties"
+       storage_share_id = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>